#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_codeartifact_domain.private-pip-artifact will be destroyed
  # (because aws_codeartifact_domain.private-pip-artifact is not in configuration)
  - resource "aws_codeartifact_domain" "private-pip-artifact" {
      - arn              = "arn:aws:codeartifact:eu-west-1:613963413230:domain/pltest-artifact" -> null
      - asset_size_bytes = 0 -> null
      - created_time     = "2022-11-23T20:06:17Z" -> null
      - domain           = "pltest-artifact" -> null
      - encryption_key   = "arn:aws:kms:eu-west-1:613963413230:key/5589d45d-31df-4443-8366-2b2f6b5b175f" -> null
      - id               = "arn:aws:codeartifact:eu-west-1:613963413230:domain/pltest-artifact" -> null
      - owner            = "613963413230" -> null
      - repository_count = 2 -> null
      - tags             = {} -> null
      - tags_all         = {
          - "Project" = "demo-github"
        } -> null
    }

  # aws_codeartifact_domain.private_pip_artifact will be created
  + resource "aws_codeartifact_domain" "private_pip_artifact" {
      + arn              = (known after apply)
      + asset_size_bytes = (known after apply)
      + created_time     = (known after apply)
      + domain           = "pltest-artifact"
      + encryption_key   = (known after apply)
      + id               = (known after apply)
      + owner            = (known after apply)
      + repository_count = (known after apply)
      + tags_all         = {
          + "Project" = "demo-github"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

</details>

*Pusher: @pglagerweij, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-pipeline-pr`*